artillery/spike-recommendation.yml
config:
  target: https://bmw3f1h1x5.execute-api.ap-southeast-1.amazonaws.com
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: Ramp up to peak load
    - duration: 120
      arrivalRate: 15
      name: Sustained peak load

scenarios:
  - name: Get recommendations
    flow:
      - post:
          url: "/dev/recommendation"
          headers:
            content-type: application/json
          body: |
            {
              "coords": {
                "latitude": 1.3362175,
                "longitude": 103.7602691,
                "altitude": null,
                "accuracy": 2585.8917160286187,
                "altitudeAccuracy": null,
                "heading": null,
                "speed": null
              },
              "timestamp": 1697470164561
            }